package com.company;

public class Main {

    public static void main(String[] args) {
        // write your code here
        Балык балык = new Балык();
        балык.setАты("Рыба-меченос");
        балык.setТүрү("Вид лучеперых рыб, отряд окунеобразных и семейство мечерылых или ксифиевых");
        балык.setСүзүүЫлдамдыгы(120);
        балык.setОрточоЖашамы(10);
        балык.setКызыктууФакт("Известны случаи когда меч-рыбы пробивали борта шлюпок, однако такие " +
                "происшествия являются случайностью,\nвызванной высокой скоростью меч-рыбы и " +
                "невозможностью быстро изменить траекторию движения. Иногда,\nвоткнувшись в борт корабля," +
                " меч-рыба не могла вытащить свой меч и погибала.\n  \n");
        System.out.println("\n " + балык.getАты() + "\n" + балык.getТүрү() + "\n" + балык.getСүзүүЫлдамдыгы() + " км/саат\n Орточо " +
                балык.getОрточоЖашамы() + " жыл жашайт.\n" + балык.getКызыктууФакт());

        Попугай попугай = new Попугай();
        попугай.setАты("Жако");
        попугай.setТүрү("Попугай Жако представляет род африканских попугаев");
        попугай.setсөзБайлыгы(1500);
        попугай.setОрточоЖашамы(50);
        попугай.setКызыктууФакт("Социальные птицы, которые при недостатке внимания впадают в депрессию, порой начинают выщипывать перья.\nУ жако склонность к самоощипу гораздо более выражена, чем у других попугаев.\n  \n");
        System.out.println(попугай.getАты() + "\n" + попугай.getТүрү() + "\n" + попугай.getсөзБайлыгы() + "\nОрточо " +
                попугай.getОрточоЖашамы() + " жыл жашайт.\n" + попугай.getКызыктууФакт());

        Мышык мышык = new Мышык();
        мышык.setАты("Toм");
        мышык.setТүрү("Саванна");
        мышык.setтүсү("Серебристый табби, Шоколадный табби, Золотистый табби");
        мышык.setОрточоЖашамы(17);
        мышык.setКызыктууФакт("Саванна – редкая порода кошек с уникальным гепардовым окрасом. Эти поразительные кошки отличаются острым умом, \nпрекрасным здоровьем, а также известны всему миру благодаря своей огромной стоимости вплоть до 20 тысяч долларов.\n  \n");
        System.out.println(мышык.getАты() + "\n" + мышык.getТүрү() + "\n" + мышык.getтүсү() + "\nОрточо " +
                мышык.getОрточоЖашамы() + " жыл жашайт.\n" + мышык.getКызыктууФакт());

        Ит ит = new Ит();
        ит.setАты("Рембо");
        ит.setТүрү("Аляскинский маламут");
        ит.setтүсү("Серый");
        ит.setОрточоЖашамы(14);
        ит.setКызыктууФакт("подвижная, дружелюбная собака с высоким интеллектом \nне любит подчиняться и отличается независимость.\n  \n");
        System.out.println(ит.getАты() + "\n" + ит.getТүрү() + "\n" + ит.getтүсү() + "\nОрточо " + ит.getОрточоЖашамы() +
                " жыл жашайт.\n" + ит.getКызыктууФакт());

    }
}
